// pages/page3/page3.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    dataArray:[
      {
        name: '张三',
        level:3,
        number:'2024070301',
        time:'2024-07-03 16:07:01',
        status:0,
        tagArry:['机器超快','环境很好','网速很快','商品丰富','价格便宜'],
        py:'这家网吧环境确实很干净,服务很到位，工作人员都很热情，电脑配置也很高，运行游戏非常快！'
      },
      {
        name: '李四',
        level:4,
        number:'2024070302',
        time:'2024-07-02 11:07:01',
        status:1,
        tagArry:['机器超快','网速很快','商品丰富','价格便宜'],
        py:'这家网吧环境确实很干净,服务很到位，工作人员都很热情，电脑配置也很高，运行游戏非常快！'
      },
      {
        name: '王五',
        level:2,
        number:'2024070303',
        time:'2024-07-03 11:07:01',
        status:0,
        tagArry:['机器超快','环境很好','商品丰富','价格便宜'],
        py:'这家网吧环境确实很干净,服务很到位，工作人员都很热情，电脑配置也很高，运行游戏非常快！'
      },
      {
        name: '赵六',
        level:5,
        number:'2024070304',
        time:'2024-07-03 14:07:01',
        status:0,
        tagArry:['机器超快','环境很好','网速很快','商品丰富','价格便宜'],
        py:'这家网吧环境确实很干净,服务很到位，工作人员都很热情，电脑配置也很高，运行游戏非常快！'
      },
      {
        name: '张三',
        level:3,
        number:'2024070301',
        time:'2024-07-03 16:07:01',
        status:0,
        tagArry:['机器超快','环境很好','网速很快','商品丰富','价格便宜'],
        py:'这家网吧环境确实很干净,服务很到位，工作人员都很热情，电脑配置也很高，运行游戏非常快！'
      },
      {
        name: '张三',
        level:3,
        number:'2024070301',
        time:'2024-07-03 16:07:01',
        status:0,
        tagArry:['机器超快','环境很好','网速很快','商品丰富','价格便宜'],
        py:'这家网吧环境确实很干净,服务很到位，工作人员都很热情，电脑配置也很高，运行游戏非常快！'
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})